<?php

return [
    '_base' => [
        'default'     => 'به نظر می رسد مشکلی پیش آمده است.',
        'throttle'    => 'تلاش های خیلی زیاد!',
        'bad_request' => 'درخواست شما نامعتبر است. لطفاً درخواست خود را بررسی کنید و دوباره امتحان کنید.',
        'forbidden'   => 'شما مجاز به انجام این درخواست نیستید.',
        'not_found'   => [
            'route' => 'مسیر (route) مورد نظر یافت نشد.',
            'item'  => [
                'default'  => 'آیتم مورد نظر یافت نشد.',
                'variable' => ':item مورد نظر یافت نشد.'
            ]
        ],
        'unauthorized' => 'شما برای دسترسی به این منبع مجوز لازم را ندارید.',
        'validation'   => 'خطایی در ارزیابی داده های ورودی رخ داده است.',
    ],

    'auth' => [
        'account' => [
            'not_confirmed' => 'حساب کاربری شما فعال نشده است.',
            'confirm' => [
                'failed' => 'فعالسازی حساب کاربری با خطا مواجه شد.',
                'input' => 'ورودی های متد فعالسازی حساب کاربری نامعتبر است.',
                'code' => [
                    'generation' => [
                        'failed' => 'خطا در ارسال کد فعالسازی. لطفا مجددا تلاش کنید.',
                        'input' => 'ورودی های متد ارسال کد فعالسازی نامعتبر است.',
                    ],
                    'invalid' => 'کد فعالسازی شما نامعتبر است.',
                ]
            ],
            'reset_password' => [
                'failed' => 'بازیابی رمز عبور با خطا مواجه شد.',
                'input' => 'ورودی های متد بازیابی رمز عبور نامعتبر است.',
                'limit' => 'در هر ۱۵ دقیقه فقط یکبار اجازه بازیابی رمز عبور را دارید.',
                'code' => [
                    'generation' => [
                        'failed' => 'خطا در ارسال کد بازیابی رمز عبور. لطفا مجددا تلاش کنید.',
                        'input' => 'ورودی های متد ارسال کد بازیابی رمز عبور نامعتبر است.',
                    ],
                    'invalid' => 'کد بازیابی رمز عبور شما نامعتبر است.',
                ]
            ]
        ],
        'login' => [
            'input' => 'اطلاعات ورودی معتبر نمی باشد.',
        ],
    ],
    'sms_service' => [
        'send_activation_code' => [
            'input' => 'ورودی های متد ارسال پیامک فعالسازی نامعتبر است.'
        ]
    ]
];
